In [1]:
import numpy as np

import pandas as pd

In [2]:
dict1={
    "name":['harry','John','akshay','shubham'],
    "marks":[30,40,50,60],
    "city":['Gaya','Texas','Banaras','Bareilly']
}

In [3]:
dict1

{'name': ['harry', 'John', 'akshay', 'shubham'],
 'marks': [30, 40, 50, 60],
 'city': ['Gaya', 'Texas', 'Banaras', 'Bareilly']}

In [4]:
pd

In [5]:
x=pd.DataFrame(dict1)
x

      name  marks      city
0    harry     30      Gaya
1     John     40     Texas
2   akshay     50   Banaras
3  shubham     60  Bareilly

# Q. What is pandas?
 * __Pandas is an open Sources data analysis library written in python.__
 * __It leverages the power and speed of numpy to make data analysis preprocessing easy for data scientiest.__
 * __It provides rich and highly robust data operations.__

# Pandas Data Structures

 * __Pandas has two types of data structure.__
 * __1. Series: It's one dimensional array with indexes, it store a single column or row of data in DataFrame.__
 * __2. DataFrame: It is tablular spreadsheet like structure representing rows each rows each of contains one or multiple columns.__

# Note:
 * __1. A One-Dimensional array(labeled) Capable of holding any type of data-Series.__
 * __2. A Two-Dimensional array(labeled) structures with columns of potentialally different types of data- DataFrame.__

In [6]:
ser=pd.Series(np.random.rand(40))

In [7]:
ser

0     0.526831
1     0.736383
2     0.156432
3     0.338430
4     0.205502
5     0.169768
6     0.403950
7     0.535606
8     0.679642
9     0.027843
10    0.253434
11    0.532178
12    0.876880
13    0.055243
14    0.953840
15    0.634560
16    0.298094
17    0.422212
18    0.468154
19    0.939981
20    0.790357
21    0.810999
22    0.837933
23    0.784762
24    0.711169
25    0.874486
26    0.678969
27    0.016448
28    0.760625
29    0.484341
30    0.863500
31    0.903289
32    0.222896
33    0.096353
34    0.049585
35    0.502534
36    0.789628
37    0.345667
38    0.587641
39    0.759375
dtype: float64

In [9]:
df

NameError: name 'df' is not defined

In [10]:
x

      name  marks      city
0    harry     30      Gaya
1     John     40     Texas
2   akshay     50   Banaras
3  shubham     60  Bareilly

In [11]:
df=pd.DataFrame(dict1)

In [12]:
# CSV= comma seperated value file.

df.to_csv('sample.csv')

# Remove Index Value

In [13]:
df=df.to_csv('sample_index_False.csv',index=False)

In [14]:
df

# head() function

In [15]:
df.head()   # name marks city ................................. .---------------,-------------,----------

AttributeError: 'NoneType' object has no attribute 'head'

# Describe() function

 * __For numeric data, the result's index will count, mean, std, min, max, as well as lower, 50 and upper percentiles. By default the lower percentile is 25 and the uppper percentile is 75. The 50 Percentile is the same as the median.__

In [16]:
df.describe()

AttributeError: 'NoneType' object has no attribute 'describe'

tail() function

In [17]:
df.tail()

AttributeError: 'NoneType' object has no attribute 'tail'

In [18]:
xyz=pd.read_csv('xyz.csv')

In [19]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [20]:
x1=pd.read_csv('Final_Employees_Data.csv')

In [21]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1

In [22]:
x1.head(10)

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3
5,6,Mary Todd,7,13,1.857143,AI,Java,ML,English,Chinese,Hindi,2,5,1,1,1,3
6,7,Nicolas Fulcher,2,2,1.000000,AI,Mobile,DotNet,English,Hindi,Telugu,1,0,1,0,0,0
7,8,Bernice Bousquet,3,4,1.333333,DotNet,Mobile,Java,English,Malayalam,Hindi,1,0,1,1,1,0
8,9,William Berger,2,5,2.500000,JS,DotNet,AI,English,Tamil,Malayalam,1,2,1,1,0,0
9,10,Kennith Hamilton,3,8,2.666667,Mobile,ML,JS,English,Kannada,Telugu,0,2,3,3,0,0

In [23]:
x1.tail(10)

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count
990,991,Joan Takemura,5,7,1.400000,JS,AI,DotNet,English,Malayalam,Kannada,2,1,1,1,1,1
991,992,Stephen Burritt,19,19,1.000000,ML,Mobile,Java,English,Malayalam,Hindi,3,5,3,4,1,3
992,993,Virginia Hamby,13,12,0.923077,AI,DotNet,ML,English,Malayalam,Kannada,5,4,1,0,0,2
993,994,Joseph Buckner,19,26,1.368421,JS,AI,Java,English,Telugu,Chinese,2,5,7,2,6,4
994,995,Glenn Bumbrey,15,17,1.133333,ML,AI,Java,English,Kannada,Malayalam,3,4,2,3,2,3
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1

In [24]:
x1.describe()

,Eid,Experience,Total_projects,Rating,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count
count,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,500.500000,12.79900,14.692000,1.293804,2.845000,2.574000,2.597000,2.409000,2.228000,2.039000
std,288.819436,6.68111,7.443288,0.622976,1.978608,1.894231,2.011128,1.980313,1.836134,1.790163
min,1.000000,2.00000,2.000000,0.357143,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,250.750000,7.00000,8.000000,0.869565,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000
50%,500.500000,13.00000,15.000000,1.166667,3.000000,2.000000,2.000000,2.000000,2.000000,2.000000
75%,750.250000,19.00000,20.000000,1.529412,4.000000,4.000000,4.000000,4.000000,4.000000,3.000000
max,1000.000000,24.00000,29.000000,4.500000,11.000000,10.000000,11.000000,12.000000,9.000000,11.000000

In [25]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [26]:
xyz['Speed']

0     50
1    200
2     55
3     65
4     23
Name: Speed, dtype: int64

In [27]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1

In [28]:
x1['Rating']

0      1.000000
1      1.444444
2      1.066667
3      1.055556
4      0.681818
         ...
995    1.125000
996    2.000000
997    0.357143
998    0.818182
999    1.181818
Name: Rating, Length: 1000, dtype: float64

In [29]:
xyz['Speed'][0]=50

C:\Users\Admin\AppData\Local\Temp\ipykernel_10828\311203616.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  xyz['Speed'][0]=50

In [30]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [31]:
xyz['Speed'][1]=200

C:\Users\Admin\AppData\Local\Temp\ipykernel_10828\1573162637.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  xyz['Speed'][1]=200

In [32]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [33]:
xyz['City'][0]='Pune'

C:\Users\Admin\AppData\Local\Temp\ipykernel_10828\2316205668.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  xyz['City'][0]='Pune'

In [34]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [35]:
xyz['City'][2]='Mumbai'

C:\Users\Admin\AppData\Local\Temp\ipykernel_10828\462731291.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  xyz['City'][2]='Mumbai'

In [36]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [37]:
xyz.to_csv('xyz.csv')

In [38]:
xyz.to_csv('xyz.csv',index=False)

In [39]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [40]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1

In [41]:
# Check the index value of your data.
x1.index

RangeIndex(start=0, stop=1000, step=1)

In [42]:
# Check the column value in your data.

x1.columns

Index(['Eid', 'Ename', 'Experience', 'Total_projects', 'Rating',
       'Area_of_Interest_1', 'Area_of_Interest_2', 'Area_of_Interest_3',
       'Language1', 'Language2', 'Language3', 'AI_project_count',
       'ML_project_count', 'JS_project_count', 'Java_project_count',
       'DotNet_project_count', 'Mobile_project_count'],
      dtype='object')

In [43]:
xyz.index

RangeIndex(start=0, stop=5, step=1)

In [44]:
xyz.columns

Index(['Train No', 'Speed', 'City'], dtype='object')

In [45]:
# How to convert numpy array
xyz.to_numpy()

array([[12322, 50, 'Pune'],
       [12547, 200, 'Delhi'],
       [125654, 55, 'Mumbai'],
       [563355, 65, 'Indian Ocean'],
       [124563, 23, 'antartica']], dtype=object)

In [46]:
x1.to_numpy()

array([[1, 'Dana Bond', 2, ..., 0, 0, 0],
       [2, 'Jesus Hampton', 9, ..., 2, 3, 1],
       [3, 'Teresa Munoz', 15, ..., 3, 5, 1],
       ...,
       [998, 'Constance Rozier', 14, ..., 1, 0, 0],
       [999, 'Elizabeth Bannister', 11, ..., 1, 0, 1],
       [1000, 'Susan Weber', 11, ..., 2, 5, 1]], dtype=object)

In [47]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [48]:
xyz.T

              0      1       2             3          4
Train No  12322  12547  125654        563355     124563
Speed        50    200      55            65         23
City       Pune  Delhi  Mumbai  Indian Ocean  antartica

In [49]:
xyz.head(2)

   Train No  Speed   City
0     12322     50   Pune
1     12547    200  Delhi

In [50]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1

In [51]:
# Sorting DataFrame by axis=0(Rows) and axis=1(Columns)

xyz.sort_index(axis=0,ascending=False)   # Descending

   Train No  Speed          City
4    124563     23     antartica
3    563355     65  Indian Ocean
2    125654     55        Mumbai
1     12547    200         Delhi
0     12322     50          Pune

In [52]:
xyz

   Train No  Speed          City
0     12322     50          Pune
1     12547    200         Delhi
2    125654     55        Mumbai
3    563355     65  Indian Ocean
4    124563     23     antartica

In [53]:
type(xyz['Train No'][2])

numpy.int64

In [54]:
xyz['Train No'][4]=123.20

C:\Users\Admin\AppData\Local\Temp\ipykernel_10828\3451755649.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  xyz['Train No'][4]=123.20
C:\Users\Admin\AppData\Local\Temp\ipykernel_10828\3451755649.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '123.2' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  xyz['Train No'][4]=123.20

In [55]:
xyz

   Train No  Speed          City
0   12322.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0     65  Indian Ocean
4     123.2     23     antartica

In [56]:
type(xyz['Train No'][4])

numpy.float64

In [57]:
type(xyz['Speed'][3])

numpy.int64

In [58]:
# Setting with copy warning. 

newdf2=xyz

In [59]:
newdf2['Train No']

0     12322.0
1     12547.0
2    125654.0
3    563355.0
4       123.2
Name: Train No, dtype: float64

In [60]:
newdf2

   Train No  Speed          City
0   12322.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0     65  Indian Ocean
4     123.2     23     antartica

In [61]:
newdf2['Train No'][0]=400

In [62]:
newdf2

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0     65  Indian Ocean
4     123.2     23     antartica

In [63]:
xyz

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0     65  Indian Ocean
4     123.2     23     antartica

In [64]:
y=xyz.copy()

In [65]:
y

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0     65  Indian Ocean
4     123.2     23     antartica

In [66]:
y['Speed'][0]=100

C:\Users\Admin\AppData\Local\Temp\ipykernel_10828\1973865409.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  y['Speed'][0]=100

In [67]:
y

   Train No  Speed          City
0     400.0    100          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0     65  Indian Ocean
4     123.2     23     antartica

In [68]:
xyz

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0     65  Indian Ocean
4     123.2     23     antartica

In [69]:
xyz

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0     65  Indian Ocean
4     123.2     23     antartica

In [70]:
z1=xyz['Speed'][3]=500

C:\Users\Admin\AppData\Local\Temp\ipykernel_10828\2421104499.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  z1=xyz['Speed'][3]=500

In [71]:
z1

500

In [72]:
xyz

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0    500  Indian Ocean
4     123.2     23     antartica

In [73]:
z1

500

In [74]:
z1=xyz

In [75]:
z1

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0    500  Indian Ocean
4     123.2     23     antartica

In [76]:
xyz

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0    500  Indian Ocean
4     123.2     23     antartica

In [77]:
# Access a group of rows and column by labels(s) or a boolean array.

In [78]:
xyz

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0    500  Indian Ocean
4     123.2     23     antartica

In [79]:
xyz

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0    500  Indian Ocean
4     123.2     23     antartica

In [80]:
xyz

   Train No  Speed          City
0     400.0     50          Pune
1   12547.0    200         Delhi
2  125654.0     55        Mumbai
3  563355.0    500  Indian Ocean
4     123.2     23     antartica

In [81]:
xyz.loc[0,0]=654

In [82]:
xyz

   Train No  Speed          City      0
0     400.0     50          Pune  654.0
1   12547.0    200         Delhi    NaN
2  125654.0     55        Mumbai    NaN
3  563355.0    500  Indian Ocean    NaN
4     123.2     23     antartica    NaN

In [83]:
xyz.loc[0,1]=100

In [84]:
xyz

   Train No  Speed          City      0      1
0     400.0     50          Pune  654.0  100.0
1   12547.0    200         Delhi    NaN    NaN
2  125654.0     55        Mumbai    NaN    NaN
3  563355.0    500  Indian Ocean    NaN    NaN
4     123.2     23     antartica    NaN    NaN

In [85]:
newdf3=xyz.copy()

In [86]:
newdf3

   Train No  Speed          City      0      1
0     400.0     50          Pune  654.0  100.0
1   12547.0    200         Delhi    NaN    NaN
2  125654.0     55        Mumbai    NaN    NaN
3  563355.0    500  Indian Ocean    NaN    NaN
4     123.2     23     antartica    NaN    NaN

In [87]:
newdf3.loc[0,0]=600

In [88]:
newdf3

   Train No  Speed          City      0      1
0     400.0     50          Pune  600.0  100.0
1   12547.0    200         Delhi    NaN    NaN
2  125654.0     55        Mumbai    NaN    NaN
3  563355.0    500  Indian Ocean    NaN    NaN
4     123.2     23     antartica    NaN    NaN

In [90]:
newdf3

   Train No  Speed          City      0      1
0     400.0     50          Pune  600.0  100.0
1   12547.0    200         Delhi    NaN    NaN
2  125654.0     55        Mumbai    NaN    NaN
3  563355.0    500  Indian Ocean    NaN    NaN
4     123.2     23     antartica    NaN    NaN

In [91]:
xyz

   Train No  Speed          City      0      1
0     400.0     50          Pune  654.0  100.0
1   12547.0    200         Delhi    NaN    NaN
2  125654.0     55        Mumbai    NaN    NaN
3  563355.0    500  Indian Ocean    NaN    NaN
4     123.2     23     antartica    NaN    NaN

In [92]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1

In [93]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1

In [94]:
x1.loc[0,'A']=65543

In [95]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0,65543.0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1,NaN
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1,NaN
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3,NaN
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1,NaN
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0,NaN
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0,NaN
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1,NaN
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1,NaN

In [96]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0,65543.0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1,NaN
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1,NaN
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3,NaN
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1,NaN
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0,NaN
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0,NaN
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1,NaN
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1,NaN

In [99]:
x1.drop(0,axis=1)

KeyError: '[0] not found in axis'

In [100]:
x1.drop(0,axis=0)

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1,NaN
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1,NaN
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3,NaN
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3,NaN
5,6,Mary Todd,7,13,1.857143,AI,Java,ML,English,Chinese,Hindi,2,5,1,1,1,3,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1,NaN
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0,NaN
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0,NaN
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1,NaN
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1,NaN

In [108]:
x1.loc[[1,2,3,4,5],['Ename','Experience','Total_projects']]

# Get some set of column and rows 

# 1,2,3,4,5 is rows and 'Ename','Experience','Total_projects' is columns

              Ename  Experience  Total_projects
1     Jesus Hampton           9              13
2      Teresa Munoz          15              16
3  Annette Dipietro          18              19
4  Jennifer Fortner          22              15
5         Mary Todd           7              13

In [109]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0,65543.0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1,NaN
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1,NaN
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3,NaN
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1,NaN
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0,NaN
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0,NaN
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1,NaN
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1,NaN

In [112]:
x1.loc[50:100 ,['Eid','Ename','Experience']]

     Eid               Ename  Experience
50    51       Barbara Amick           6
51    52     Melissa Montoya          16
52    53    Samantha Vasquez          10
53    54  Esperanza Galletti          16
54    55         Leroy Smith          11
55    56     Gertrude Curtis           4
56    57        Yvonne Caron           8
57    58          Lisa Green          17
58    59      Clare Stockton          10
59    60        Candace Odum          22
60    61          Linda Reck           6
61    62     Sallie Jennings           6
62    63       Tarsha Caines          23
63    64       Wayne Johnson           5
64    65      Jesusita Adams           4
65    66         John Campos          10
66    67        Tabatha Pena          17
67    68   Timothy Mcpherson          14
68    69  Brandon Wainwright          11
69    70         Bruce Ellis          14
70    71      Robert Saddler          12
71    72         Cathy Brown          23
72    73      Marianne Welsh          24
73    74    Antonio Mcclanan          19
74    75       Carol Defabio          23
75    76        Marion Hicks          16
76    77        Brian Sparks           8
77    78         Alan Duncan           8
78    79         Lloyd Lahay          14
79    80        Melissa Cruz           2
80    81     Patrick Scavone          17
81    82     Barrie Cosgrove           4
82    83         Judy Minton          17
83    84        Jose Durrant           5
84    85      Rebecca Marlow           9
85    86       Nancy Jackson          19
86    87       Kenneth Heyne           7
87    88    Kathryn Cottrell          14
88    89    Candace Robinson          17
89    90       Sarah Burkley          22
90    91     William Hawkins          17
91    92       Dominick Cruz          22
92    93     Jerry Parkinson          21
93    94        William Wolf           9
94    95     Charles Braxton          24
95    96      Diane Williams           7
96    97        Sarah Wilson           4
97    98         Erika Brown           9
98    99          Paul Ortiz          13
99   100       Suzanne Devoe          19
100  101     George Carbaugh          14

In [118]:
x1.loc[[1,2,3],'Language1':'ML_project_count']

  Language1 Language2  Language3  AI_project_count  ML_project_count
1   English     Hindi  Malayalam                 4                 3
2   English   Kannada    Chinese                 3                 3
3   English   Chinese      Tamil                 4                 4

In [138]:
x1.loc[(x1['Total_projects']<5)]

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0,65543.0
6,7,Nicolas Fulcher,2,2,1.000000,AI,Mobile,DotNet,English,Hindi,Telugu,1,0,1,0,0,0,NaN
7,8,Bernice Bousquet,3,4,1.333333,DotNet,Mobile,Java,English,Malayalam,Hindi,1,0,1,1,1,0,NaN
34,35,Elsie Holman,4,3,0.750000,Java,JS,DotNet,English,Kannada,Malayalam,2,0,0,1,0,0,NaN
81,82,Barrie Cosgrove,4,3,0.750000,JS,AI,Java,English,Tamil,Malayalam,0,2,0,1,0,0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
928,929,Fran Worthington,3,3,1.000000,JS,Java,AI,English,Hindi,Tamil,2,0,1,0,0,0,NaN
943,944,James Herndon,2,2,1.000000,Mobile,JS,DotNet,English,Japenese,Telugu,0,1,1,0,0,0,NaN
947,948,Vincent Deininger,3,2,0.666667,ML,JS,Java,English,Telugu,Japenese,0,0,2,0,0,0,NaN
951,952,George Slayton,3,2,0.666667,Java,AI,JS,English,Japenese,Chinese,1,0,1,0,0,0,NaN
982,983,Sylvia Thigpen,2,3,1.500000,Mobile,ML,JS,English,Kannada,Telugu,0,0,1,2,0,0,NaN

In [139]:
x1.loc[(x1['Rating']<3)]

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0,65543.0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1,NaN
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1,NaN
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3,NaN
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1,NaN
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0,NaN
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0,NaN
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1,NaN
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1,NaN

In [142]:
x1.loc[(x1['Rating']<3)& (x1['Total_projects']>5)]

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1,NaN
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1,NaN
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3,NaN
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3,NaN
5,6,Mary Todd,7,13,1.857143,AI,Java,ML,English,Chinese,Hindi,2,5,1,1,1,3,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
994,995,Glenn Bumbrey,15,17,1.133333,ML,AI,Java,English,Kannada,Malayalam,3,4,2,3,2,3,NaN
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1,NaN
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0,NaN
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1,NaN
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1,NaN

# iloc
 * __iloc is particular useful when you want ot access DataFrame elemenets by their numerical position rather than label or when you want ot integer-based slicing of rows and columns.__

In [147]:
x1.iloc[0,1]

'Dana Bond'

In [145]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0,65543.0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1,NaN
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1,NaN
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3,NaN
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1,NaN
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0,NaN
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0,NaN
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1,NaN
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1,NaN

In [151]:
x1.iloc[[0,555],[3,4]]   # 0,555 is rows index value and 3,4 is columns index value.

     Total_projects    Rating
0                 2  1.000000
555              17  1.416667

In [155]:
x1.head()

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0,65543.0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1,NaN
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1,NaN
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3,NaN
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3,NaN

In [156]:
x1.drop(['Area_of_Interest_1'],axis=1)

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
0,1,Dana Bond,2,2,1.000000,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0,65543.0
1,2,Jesus Hampton,9,13,1.444444,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1,NaN
2,3,Teresa Munoz,15,16,1.066667,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1,NaN
3,4,Annette Dipietro,18,19,1.055556,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3,NaN
4,5,Jennifer Fortner,22,15,0.681818,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1,NaN
996,997,Trista Cheek,3,6,2.000000,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0,NaN
997,998,Constance Rozier,14,5,0.357143,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0,NaN
998,999,Elizabeth Bannister,11,9,0.818182,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1,NaN
999,1000,Susan Weber,11,13,1.181818,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1,NaN

In [157]:
x1.drop([0],axis=0)

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1,NaN
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1,NaN
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3,NaN
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3,NaN
5,6,Mary Todd,7,13,1.857143,AI,Java,ML,English,Chinese,Hindi,2,5,1,1,1,3,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1,NaN
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0,NaN
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0,NaN
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1,NaN
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1,NaN

In [160]:
x1.drop(['Area_of_Interest_1','Area_of_Interest_2','Area_of_Interest_3'],axis=1)

,Eid,Ename,Experience,Total_projects,Rating,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
0,1,Dana Bond,2,2,1.000000,English,Hindi,Tamil,0,1,1,0,0,0,65543.0
1,2,Jesus Hampton,9,13,1.444444,English,Hindi,Malayalam,4,3,0,2,3,1,NaN
2,3,Teresa Munoz,15,16,1.066667,English,Kannada,Chinese,3,3,1,3,5,1,NaN
3,4,Annette Dipietro,18,19,1.055556,English,Chinese,Tamil,4,4,2,3,3,3,NaN
4,5,Jennifer Fortner,22,15,0.681818,English,Chinese,Telugu,3,4,3,1,1,3,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,English,Telugu,Tamil,11,3,2,6,4,1,NaN
996,997,Trista Cheek,3,6,2.000000,English,Chinese,Telugu,1,0,2,1,2,0,NaN
997,998,Constance Rozier,14,5,0.357143,English,Kannada,Telugu,2,1,1,1,0,0,NaN
998,999,Elizabeth Bannister,11,9,0.818182,English,Tamil,Japenese,4,2,1,1,0,1,NaN
999,1000,Susan Weber,11,13,1.181818,English,Telugu,Hindi,4,0,1,2,5,1,NaN

In [161]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Area_of_Interest_1,Area_of_Interest_2,Area_of_Interest_3,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
0,1,Dana Bond,2,2,1.000000,DotNet,JS,AI,English,Hindi,Tamil,0,1,1,0,0,0,65543.0
1,2,Jesus Hampton,9,13,1.444444,DotNet,AI,JS,English,Hindi,Malayalam,4,3,0,2,3,1,NaN
2,3,Teresa Munoz,15,16,1.066667,ML,JS,Java,English,Kannada,Chinese,3,3,1,3,5,1,NaN
3,4,Annette Dipietro,18,19,1.055556,DotNet,ML,Mobile,English,Chinese,Tamil,4,4,2,3,3,3,NaN
4,5,Jennifer Fortner,22,15,0.681818,Mobile,Java,JS,English,Chinese,Telugu,3,4,3,1,1,3,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,Java,Mobile,AI,English,Telugu,Tamil,11,3,2,6,4,1,NaN
996,997,Trista Cheek,3,6,2.000000,Mobile,ML,DotNet,English,Chinese,Telugu,1,0,2,1,2,0,NaN
997,998,Constance Rozier,14,5,0.357143,AI,ML,Mobile,English,Kannada,Telugu,2,1,1,1,0,0,NaN
998,999,Elizabeth Bannister,11,9,0.818182,JS,ML,DotNet,English,Tamil,Japenese,4,2,1,1,0,1,NaN
999,1000,Susan Weber,11,13,1.181818,ML,AI,JS,English,Telugu,Hindi,4,0,1,2,5,1,NaN

In [162]:
x1.drop(['Area_of_Interest_1','Area_of_Interest_2','Area_of_Interest_3'],axis=1,inplace=True)

In [163]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
0,1,Dana Bond,2,2,1.000000,English,Hindi,Tamil,0,1,1,0,0,0,65543.0
1,2,Jesus Hampton,9,13,1.444444,English,Hindi,Malayalam,4,3,0,2,3,1,NaN
2,3,Teresa Munoz,15,16,1.066667,English,Kannada,Chinese,3,3,1,3,5,1,NaN
3,4,Annette Dipietro,18,19,1.055556,English,Chinese,Tamil,4,4,2,3,3,3,NaN
4,5,Jennifer Fortner,22,15,0.681818,English,Chinese,Telugu,3,4,3,1,1,3,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,English,Telugu,Tamil,11,3,2,6,4,1,NaN
996,997,Trista Cheek,3,6,2.000000,English,Chinese,Telugu,1,0,2,1,2,0,NaN
997,998,Constance Rozier,14,5,0.357143,English,Kannada,Telugu,2,1,1,1,0,0,NaN
998,999,Elizabeth Bannister,11,9,0.818182,English,Tamil,Japenese,4,2,1,1,0,1,NaN
999,1000,Susan Weber,11,13,1.181818,English,Telugu,Hindi,4,0,1,2,5,1,NaN

In [164]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
0,1,Dana Bond,2,2,1.000000,English,Hindi,Tamil,0,1,1,0,0,0,65543.0
1,2,Jesus Hampton,9,13,1.444444,English,Hindi,Malayalam,4,3,0,2,3,1,NaN
2,3,Teresa Munoz,15,16,1.066667,English,Kannada,Chinese,3,3,1,3,5,1,NaN
3,4,Annette Dipietro,18,19,1.055556,English,Chinese,Tamil,4,4,2,3,3,3,NaN
4,5,Jennifer Fortner,22,15,0.681818,English,Chinese,Telugu,3,4,3,1,1,3,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,English,Telugu,Tamil,11,3,2,6,4,1,NaN
996,997,Trista Cheek,3,6,2.000000,English,Chinese,Telugu,1,0,2,1,2,0,NaN
997,998,Constance Rozier,14,5,0.357143,English,Kannada,Telugu,2,1,1,1,0,0,NaN
998,999,Elizabeth Bannister,11,9,0.818182,English,Tamil,Japenese,4,2,1,1,0,1,NaN
999,1000,Susan Weber,11,13,1.181818,English,Telugu,Hindi,4,0,1,2,5,1,NaN

In [165]:
x1.reset_index()

,index,Eid,Ename,Experience,Total_projects,Rating,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
0,0,1,Dana Bond,2,2,1.000000,English,Hindi,Tamil,0,1,1,0,0,0,65543.0
1,1,2,Jesus Hampton,9,13,1.444444,English,Hindi,Malayalam,4,3,0,2,3,1,NaN
2,2,3,Teresa Munoz,15,16,1.066667,English,Kannada,Chinese,3,3,1,3,5,1,NaN
3,3,4,Annette Dipietro,18,19,1.055556,English,Chinese,Tamil,4,4,2,3,3,3,NaN
4,4,5,Jennifer Fortner,22,15,0.681818,English,Chinese,Telugu,3,4,3,1,1,3,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,995,996,Nicole Meeks,24,27,1.125000,English,Telugu,Tamil,11,3,2,6,4,1,NaN
996,996,997,Trista Cheek,3,6,2.000000,English,Chinese,Telugu,1,0,2,1,2,0,NaN
997,997,998,Constance Rozier,14,5,0.357143,English,Kannada,Telugu,2,1,1,1,0,0,NaN
998,998,999,Elizabeth Bannister,11,9,0.818182,English,Tamil,Japenese,4,2,1,1,0,1,NaN
999,999,1000,Susan Weber,11,13,1.181818,English,Telugu,Hindi,4,0,1,2,5,1,NaN

In [166]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
0,1,Dana Bond,2,2,1.000000,English,Hindi,Tamil,0,1,1,0,0,0,65543.0
1,2,Jesus Hampton,9,13,1.444444,English,Hindi,Malayalam,4,3,0,2,3,1,NaN
2,3,Teresa Munoz,15,16,1.066667,English,Kannada,Chinese,3,3,1,3,5,1,NaN
3,4,Annette Dipietro,18,19,1.055556,English,Chinese,Tamil,4,4,2,3,3,3,NaN
4,5,Jennifer Fortner,22,15,0.681818,English,Chinese,Telugu,3,4,3,1,1,3,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,English,Telugu,Tamil,11,3,2,6,4,1,NaN
996,997,Trista Cheek,3,6,2.000000,English,Chinese,Telugu,1,0,2,1,2,0,NaN
997,998,Constance Rozier,14,5,0.357143,English,Kannada,Telugu,2,1,1,1,0,0,NaN
998,999,Elizabeth Bannister,11,9,0.818182,English,Tamil,Japenese,4,2,1,1,0,1,NaN
999,1000,Susan Weber,11,13,1.181818,English,Telugu,Hindi,4,0,1,2,5,1,NaN

In [167]:
x1.drop([0,1,2],axis=0,inplace=True)

In [168]:
x1

,Eid,Ename,Experience,Total_projects,Rating,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
3,4,Annette Dipietro,18,19,1.055556,English,Chinese,Tamil,4,4,2,3,3,3,NaN
4,5,Jennifer Fortner,22,15,0.681818,English,Chinese,Telugu,3,4,3,1,1,3,NaN
5,6,Mary Todd,7,13,1.857143,English,Chinese,Hindi,2,5,1,1,1,3,NaN
6,7,Nicolas Fulcher,2,2,1.000000,English,Hindi,Telugu,1,0,1,0,0,0,NaN
7,8,Bernice Bousquet,3,4,1.333333,English,Malayalam,Hindi,1,0,1,1,1,0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Nicole Meeks,24,27,1.125000,English,Telugu,Tamil,11,3,2,6,4,1,NaN
996,997,Trista Cheek,3,6,2.000000,English,Chinese,Telugu,1,0,2,1,2,0,NaN
997,998,Constance Rozier,14,5,0.357143,English,Kannada,Telugu,2,1,1,1,0,0,NaN
998,999,Elizabeth Bannister,11,9,0.818182,English,Tamil,Japenese,4,2,1,1,0,1,NaN
999,1000,Susan Weber,11,13,1.181818,English,Telugu,Hindi,4,0,1,2,5,1,NaN

In [169]:
x1.reset_index()

,index,Eid,Ename,Experience,Total_projects,Rating,Language1,Language2,Language3,AI_project_count,ML_project_count,JS_project_count,Java_project_count,DotNet_project_count,Mobile_project_count,A
0,3,4,Annette Dipietro,18,19,1.055556,English,Chinese,Tamil,4,4,2,3,3,3,NaN
1,4,5,Jennifer Fortner,22,15,0.681818,English,Chinese,Telugu,3,4,3,1,1,3,NaN
2,5,6,Mary Todd,7,13,1.857143,English,Chinese,Hindi,2,5,1,1,1,3,NaN
3,6,7,Nicolas Fulcher,2,2,1.000000,English,Hindi,Telugu,1,0,1,0,0,0,NaN
4,7,8,Bernice Bousquet,3,4,1.333333,English,Malayalam,Hindi,1,0,1,1,1,0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
992,995,996,Nicole Meeks,24,27,1.125000,English,Telugu,Tamil,11,3,2,6,4,1,NaN
993,996,997,Trista Cheek,3,6,2.000000,English,Chinese,Telugu,1,0,2,1,2,0,NaN
994,997,998,Constance Rozier,14,5,0.357143,English,Kannada,Telugu,2,1,1,1,0,0,NaN
995,998,999,Elizabeth Bannister,11,9,0.818182,English,Tamil,Japenese,4,2,1,1,0,1,NaN
996,999,1000,Susan Weber,11,13,1.181818,English,Telugu,Hindi,4,0,1,2,5,1,NaN